{
  "organizational_barriers": {
    "rigid_structures": [
      "All decisions must go through the owner. Even small collaborations need approval.",
      "We have a very hierarchical system. Junior staff cannot directly engage with external partners.",
      "The bureaucracy in our organization makes it difficult to respond quickly to collaboration opportunities."
    ],
    "cultural_resistance": [
      "We prefer to keep our innovations secret. Sharing with others might help competitors.",
      "There is a strong belief that good ideas must come from within the company.",
      "Previous bad experiences with partners have made us very cautious about collaboration."
    ],
    "resource_constraints": [
      "We simply don't have the funds to invest in collaborative projects.",
      "Our staff are already overworked. We cannot spare anyone for external projects.",
      "The cost of protecting our intellectual property is too high for us."
    ],
    "trust_issues": [
      "We have been cheated before by partners who stole our ideas.",
      "It's difficult to find trustworthy partners in our industry.",
      "Without proper legal protection, we cannot risk sharing our knowledge."
    ]
  },
  "digital_literacy_impact": {
    "enabling_collaboration": [
      "WhatsApp groups have made it easier to coordinate with suppliers and customers.",
      "Online platforms help us find partners we would never have met otherwise.",
      "Digital tools allow us to share documents and collaborate despite distance."
    ],
    "knowledge_access": [
      "YouTube tutorials have taught us new production techniques.",
      "We use Google to research market trends and competitor products.",
      "Online forums connect us with experts who can solve technical problems."
    ],
    "capability_gaps": [
      "Many of our staff struggle with basic computer tasks.",
      "We know digital tools exist but don't know how to use them effectively.",
      "The younger employees are good with technology but lack business experience."
    ]
  },
  "contextual_factors": {
    "infrastructure_challenges": [
      "Internet connectivity is unreliable, making online collaboration difficult.",
      "Power outages disrupt our digital operations regularly.",
      "The cost of data is too high for sustained online engagement."
    ],
    "policy_environment": [
      "Government regulations are unclear about digital business operations.",
      "There is no support for SMEs trying to innovate collaboratively.",
      "Tax policies do not recognize innovation expenses."
    ],
    "market_dynamics": [
      "Customers still prefer face-to-face interactions over digital channels.",
      "The local market is too small to justify innovation investments.",
      "Competition from imports makes it hard to recover innovation costs."
    ]
  }
}